## Pandas in Python

In [1]:
import pandas as pd

### Create Dataframes

In [2]:
# Specify the value for each column
df = pd.DataFrame({
        "a":[1,2,3],
        "b":[4,5,6],
        "c":[7,8,9]
        },
        index = [1,2,3]
    )

print(df)

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [3]:
# Specify the value for each row
df2 = pd.DataFrame([[4,7,10],
                    [5,8,11],
                    [6,9,12]],
                   index = [1,2,3],
                   columns = ['a','b','c']
                   )

print(df2)

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
# Specify the value for each with multiindex
df3 = pd.DataFrame({
        "a":[1,2,3],
        "b":[4,5,6],
        "c":[7,8,9]},
        index = pd.MultiIndex.from_tuples(
            [('d',1),('d',2),
             ('e',2)], names=['n','v']
        ))

print(df3)

     a  b  c
n v
d 1  1  4  7
  2  2  5  8
e 2  3  6  9

### Method Chaining

Most pandas methods return a dataframe so that another pandas method can be applied to the result. This improves readability of code.

In [5]:
df4 = (pd.melt(df).rename(columns={"variable":"var", "value":"val"}).query('val >= 5'))
print(df4)

  var  val
4   b    5
5   b    6
6   c    7
7   c    8
8   c    9

### Reshaping Data

Change layout, sorting, reindexing, renaming

In [6]:
# Change columns into rows
df5 = pd.melt(df)
print(f'df before: {df}, \n and after: {df5}')

df before:    a  b  c
1  1  4  7
2  2  5  8
3  3  6  9,
 and after:   variable  value
0        a      1
1        a      2
2        a      3
3        b      4
4        b      5
5        b      6
6        c      7
7        c      8
8        c      9

In [7]:
# Append rows of DataFrames
df6 = pd.concat([df,df2])
print(df6)

   a  b   c
1  1  4   7
2  2  5   8
3  3  6   9
1  4  7  10
2  5  8  11
3  6  9  12

In [8]:
# Spread rows into columns
df7 = df6.pivot(columns='a', values=['b','c'])
print("df before: \n", df6,"\n and after: \n", df7)

df before:
    a  b   c
1  1  4   7
2  2  5   8
3  3  6   9
1  4  7  10
2  5  8  11
3  6  9  12
 and after:
      b                             c
a    1    2    3    4    5    6    1    2    3     4     5     6
1  4.0  NaN  NaN  7.0  NaN  NaN  7.0  NaN  NaN  10.0   NaN   NaN
2  NaN  5.0  NaN  NaN  8.0  NaN  NaN  8.0  NaN   NaN  11.0   NaN
3  NaN  NaN  6.0  NaN  NaN  9.0  NaN  NaN  9.0   NaN   NaN  12.0

In [9]:
# Append columns of DataFrames
df8 = pd.concat([df,df2], axis = 1)
print(df8)

   a  b  c  a  b   c
1  1  4  7  4  7  10
2  2  5  8  5  8  11
3  3  6  9  6  9  12

#### Ordering

In [10]:
# Order rows by values of a columns from low to high (ascending)
print(df.sort_values('a'))

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [11]:
# Order rows by values of a columns from high to low (descending)
print(df.sort_values('a', ascending=False))

   a  b  c
3  3  6  9
2  2  5  8
1  1  4  7

#### Reindexing

In [12]:
# Sort the index of a dataframe ascending
print(df.sort_index())

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [13]:
# Sort the index of a dataframe descending
print(df.sort_index(ascending=False))

   a  b  c
3  3  6  9
2  2  5  8
1  1  4  7

In [14]:
# reset the index of a dataframe
df8 = df6.reset_index()
print("before: \n", df6, "\n and after: \n", df8)

before:
    a  b   c
1  1  4   7
2  2  5   8
3  3  6   9
1  4  7  10
2  5  8  11
3  6  9  12
 and after:
    index  a  b   c
0      1  1  4   7
1      2  2  5   8
2      3  3  6   9
3      1  4  7  10
4      2  5  8  11
5      3  6  9  12

#### Layout Canges (rename, drop)

In [15]:
# Renaming columns
df9 = df.rename(columns={'a':'1st', 'b':'2nd', 'c':'3rd'})
print(df9)

   1st  2nd  3rd
1    1    4    7
2    2    5    8
3    3    6    9

In [16]:
# Drop columns
df10 = df.drop(columns=['b','c'])
print(df10)

   a
1  1
2  2
3  3

### Subset Observations - rows

In [17]:
df[df.a >=2]

   a  b  c
2  2  5  8
3  3  6  9

In [18]:
df.drop_duplicates()

   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9

In [19]:
df.sample(frac=0.33)

   a  b  c
1  1  4  7

In [20]:
df.sample(n=2)

   a  b  c
3  3  6  9
2  2  5  8

In [21]:
df.nlargest(2, 'a')

   a  b  c
3  3  6  9
2  2  5  8

In [22]:
df.nsmallest(2, 'a')

   a  b  c
1  1  4  7
2  2  5  8

In [23]:
df.head(2)

   a  b  c
1  1  4  7
2  2  5  8

In [24]:
df.tail(2)

   a  b  c
2  2  5  8
3  3  6  9

### Subset Variables - Columns

In [25]:
df[['a','b']]

   a  b
1  1  4
2  2  5
3  3  6

In [26]:
# Select columns with dictionary style
df['a']

1    1
2    2
3    3
Name: a, dtype: int64

In [27]:
# Select column called 'a' with attribute style
df.a

1    1
2    2
3    3
Name: a, dtype: int64

In [28]:
# Select columns with regex
df.filter(regex='a')

   a
1  1
2  2
3  3

### Query

In [29]:
df.query('a >= 2')

   a  b  c
2  2  5  8
3  3  6  9

In [30]:
df.query('a >= 2 and b > 5')

   a  b  c
3  3  6  9

In [31]:
df_str = pd.DataFrame(
    {
    'A':['A','B','C'],
    'B':['D','E','F'],
    'C':['G','H','I']},
    index=[1,2,3]
)

In [32]:
# df_str.query('A.str.startswith("B")', engine='python')

### Subsets - rows and columns

- Use df.loc[] and df.iloc[] to select only rows, only columns or both
- Use df.at[] and df.iat[] to access a single value by row and column


|Syntax|Type|Purpose|Why []?|
| ----- | ----- | ----- | ----- | 
|df.loc[]|Label-based|Navigation (Go to this coordinate)|"It's a ""Map"" lookup allows slicing with :."|
|df.iloc[]|Integer-Based|Navigation (Go to this position)|"It's a ""List"" lookup; allows slicing with :."|
|df.at|Label-based|Access a single cell by name|
|df.iat|Integer-based|access a single cell by position|

#### Loc and iloc

In [33]:
df.reset_index(drop=True).loc[0:1,['a','b']] # Select rows 0-1 inclusive

   a  b
0  1  4
1  2  5

In [34]:
df.reset_index(drop=True).loc[0:1,'a':'c'] # Select rows 0-1 inclusive and columns a-c inclusive

   a  b  c
0  1  4  7
1  2  5  8

In [35]:
df.iloc[0:1,1:3] # Select rows 0-1 inclusive and columns 1-3 exclusive

   b  c
1  4  7

#### at and iat

In [36]:
df.iat[1,2] # Select the value at row 1 and column 2 (Use index)

8

In [37]:
df.at[2,'b'] # Select the value at row 2 and column 'b' (use column name)

5

### Logic and Regex 
![Table Describing the logic in Python and Regex](/home/vilourenco/pandas-practice/image.png)

### Group Data

-> Overall Information
- value_counts()        - Count **number of rows** with each **unique value of variable**
- len()                 - **# of rows** in DataFrame
- df.shape              - Tuple of **# of rows, # of columns** in DataFrame
- df['a'].nunique()     - **# of distinct values** in a **column**
- df.describe()         - **Basic descriptive and statistics** for each **column** (or GroupBy)
- df.info()             - Prints a **concise summary of the DataFrame**
- df.memory_usage       - Prints the **memory usage** of each **column** in the df
- df.dtypes()           - Print a **series with the dtype** of each column in the df

-> Summary functions
- sum()                 - Sum values of each object
- count()               - Count non-NA/null of each object
- median()              - Median value of each object
- quantile([0.25,0.75]) - Quantiles of each object
- apply(function)       - Apply function to each object
- min()                 - Minimum value of each object
- max()                 - Maximum value of each object
- mean()                - Mean value of each object
- var()                 - Variance of each object
- std()                 - Standard deviation of each object

In [38]:
""" Overall Information """

print(f"1.Value Counts: {df['a'].value_counts()}")
print(f"2.Length of DataFrame: {len(df)}")
print(f"3.Shape of DataFrame: {df.shape}")
print(f"4.Unique values in column 'a': {df['a'].nunique()}")
print(f"5.DataFrame Description:\n{df.describe()}")
print(f"6.DataFrame Info:\n{df.info()}")
print(f"7.Memory Usage:\n{df.memory_usage()}")
print(f"8.Data Types:\n{df.dtypes}")

1.Value Counts: a
1    1
2    1
3    1
Name: count, dtype: int64
2.Length of DataFrame: 3
3.Shape of DataFrame: (3, 3)
4.Unique values in column 'a': 3
5.DataFrame Description:
         a    b    c
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0
<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes
6.DataFrame Info:
None
7.Memory Usage:
Index    132
a         24
b         24
c         24
dtype: int64
8.Data Types:
a    int64
b    int64
c    int64
dtype: object

In [ ]:
""" Summary Statistics """

print(f"9.Sum of column 'b': {df['b'].sum()}")
print(f"10.Mean of column 'b': {df['b'].mean()}")
print(f"11.Standard Deviation of column 'b': {df['b'].std()}")
print(f"12.Minimum value in column 'b': {df['b'].min()}")
print(f"13.Maximum value in column 'b': {df['b'].max()}")
print(f"14.Count of non-null values in column 'b': {df['b'].count()}")
print(f"15.Median of column 'b': {df['b'].median()}")
print(f"16.Mode of column 'b': {df['b'].mode().iloc[0] if not df['b'].mode().empty else 'No mode'}")
print(f"17.Quartiles of column 'b': \n{df['b'].quantile([0.25, 0.5, 0.75])}")
print(f"18.Variance of column 'b': {df['b'].var()}") # Strange....

9.Sum of column 'b': 15
10.Mean of column 'b': 5.0
11.Standard Deviation of column 'b': 1.0
12.Minimum value in column 'b': 4
13.Maximum value in column 'b': 6
14.Count of non-null values in column 'b': 3
15.Median of column 'b': 5.0
16.Mode of column 'b': 4
17.Quartiles of column 'b':
0.25    4.5
0.50    5.0
0.75    5.5
Name: b, dtype: float64
18.Variance of column 'b': 1.0

### Group Data

- df.groupby(by="col")              - Return a groupby object, grouped by values in column named col
- df.groupby(level="ind")           - Return a GroupBy object, grouped by values in index level "ind"
- df.size()                         - Return the size of each  group
- df.agg(function)                  - Aggregate group using function

In [63]:
df_groupby = pd.DataFrame({
        "a":[1,1,2,3],
        "b":[4,5,6,7],
        "c":[7,8,9,10]
        },
        index = [1,1,2,3]
    )

In [67]:
print(f"Group by column a: \n {df_groupby.groupby(by='a').sum()}")
print(f"Group by index level: \n{df_groupby.groupby(level=0).sum()}")
print(f"Give the size of the dataframe: {df_groupby.size}")
print(f"Give the aggregated values: \n{df_groupby.groupby(by='a').agg(['sum','mean','std', 'var'])}")

Group by column a:
    b   c
a
1  9  15
2  6   9
3  7  10
Group by index level:
   a  b   c
1  2  9  15
2  2  6   9
3  3  7  10
Give the size of the dataframe: 12
Give the aggregated values:
    b                       c
  sum mean       std  var sum  mean       std  var
a
1   9  4.5  0.707107  0.5  15   7.5  0.707107  0.5
2   6  6.0       NaN  NaN   9   9.0       NaN  NaN
3   7  7.0       NaN  NaN  10  10.0       NaN  NaN

### Handling Missing Data

- df.dropna()         - Drop rows with any column having NA/null data
- df.fillna()         - Replace all NA/null data with value

In [75]:
# Drop NaN values in the aggregated results
df_groupby.groupby(by='a').agg(['sum','mean','std', 'var']).dropna()

    b                       c
  sum mean       std  var sum mean       std  var
a
1   9  4.5  0.707107  0.5  15  7.5  0.707107  0.5

In [72]:
# Fill NaN values with 0 in the aggregated results
df_groupby.groupby(by='a').agg(['sum','mean','std', 'var']).fillna(0)

    b                       c
  sum mean       std  var sum  mean       std  var
a
1   9  4.5  0.707107  0.5  15   7.5  0.707107  0.5
2   6  6.0  0.000000  0.0   9   9.0  0.000000  0.0
3   7  7.0  0.000000  0.0  10  10.0  0.000000  0.0

### Make new Columns

- df.assign(Area=lambda df: df.a*df.b)          - Compute and append one or more new columns

In [91]:
print(df.assign(Volume=lambda df: df['a'] * df['b'] * df['c']))
df.drop(columns=['Volume'], inplace=True)

   a  b  c  Volume
1  1  4  7      28
2  2  5  8      80
3  3  6  9     162

In [ ]:
print(f"before: \n{df}")
df['Volume'] = df['a'] * df['b'] * df['c']
print(f"after: \n{df}")
df.drop(columns=['Volume'], inplace=True)

before:
   a  b  c
1  1  4  7
2  2  5  8
3  3  6  9
after:
   a  b  c  Volume
1  1  4  7      28
2  2  5  8      80
3  3  6  9     162

In [112]:
# Create bins for column 'a' and assign labels
# Helpful when you want to convert a continuous numerical variable into a categorical variable in ML tasks

pd.qcut(df_groupby.a, 2, labels=['Bronze', 'Silver'])

1    Bronze
1    Bronze
2    Silver
3    Silver
Name: a, dtype: category
Categories (2, object): ['Bronze' < 'Silver']